START = """*Homeworker bot*. Тут домашняя работа."""

HELP = """Используйте _дополнительную клавиатуру_, чтобы выбрать действие"""

ABOUT = """`Homework bot for Telegram. Based on python w/ pyTelegramBotAPI and cloud platform heroku.
    
Copyright (C) 2020 Artemiy Denisov. All Rights Reserved.
    
To use, simply click on Reply Keyboard Markup and donate me!`

Денисов Артемий 10Д-ИТ"""

FEEDBACK = """Пятёрки ставить ему:
@dam\_mek или [ему](https://vk.com/dam_mek)

Лайки ставить [ему](https://www.instagram.com/dam_mek)"""

ASK_TEXT = """Выберите интересующий вас пункт"""

ASK_EXACTLY_TEXT = """Введите *именно* число"""

P_1 = """Алгоритмом называется точная инструкция исполнителю в понятной для него форме, определяющая процесс достижения поставленной цели на основе имеющихся исходных данных за конечное число шагов.
1)	*Универсальность (массовость)* - применимость алгоритма к различным наборам исходных данных.
2)	*Дискретность* - процесс решения задачи по алгоритму разбит на отдельные действия.
3)	*Однозначность* - правила и порядок выполнения действий алгоритма имеют единственное толкование.
4)	*Конечность* - каждое из действий и весь алгоритм в целом обязательно завершаются.
5)	*Результативность* - по завершении выполнения алгоритма обязательно получается конечный результат.
6)	*Выполнимость* - результата алгоритма достигается за конечное число шагов."""

P_2 = """`#include <name> // name — название нужной библиотеки
…
#include <another_name>

int main()
{ 
// Основной код 
return 0; // Возвращаем нуль, чтобы оповестить компилятор, что ошибок не было
}`

stdio.h — библиотека ввода-вывода на C
iostream — библиотека ввода-вывода на C++"""

P_3 = """Ввод:
1)	C — `scanf("Cтрока Форматов", адрес1, …, адресn);`
2)	C++ — `cin >> переменная1 >> … >> переменнаяn;`"""

P_4 = """Вывод:
1)	C — `printf("Строка Форматов", объект1, …, объектn);`
2)	C++ — `cout << переменная1 << … << переменнаяn;`"""

P_5 = """1)	*SyntaxError* - синтаксическая ошибка
2)	*TypeError* - операция применена к объекту несоответствующего типа.
3)	*MemoryError* - недостаточно памяти.
4)	*NameError* - не найдено переменной с таким именем.
5)	*IndexError* - индекс не входит в диапазон элементов."""

P_6 = """\\r — возврат каретки в начало строки
\\n — новая строка
\\t — горизонтальная табуляция
\\v — вертикальная табуляция
\\» — двойные кавычки
\\’ — апостроф
\\\ — обратный слеш
\\0 — нулевой символ
\\? — знак вопроса
\\a — сигнал бипера (спикера) компьютера"""

P_7 = """int — целочисленный тип данных.
float — тип данных с плавающей запятой.
double — тип данных с плавающей запятой двойной точности.
char — символьный тип данных.
bool — логический тип данных.
void — тип без значения.

char, signed char: диапазон от -128 до 127.

unsigned char: диапазон от 0 до 255.

signed short, signed short int, short, short int: диапазон от –32768 до 32767.

unsigned short, unsigned short int: от 0 до 65535. 

long int, long, signed long, signed long int, signed, signed int, int: диапазон от −2147483648 до 2147483647.

unsigned long int, unsigned long, unsigned, unsigned int: диапазон от 0 до 4294967295.

signed long long, signed long long int, long long, long long int: диапазон от −9223372036854775808 до 9223372036854775807.

unsigned long long, unsigned long long int: диапазон от 0 до 18446744073709551615.

float: диапазон от -2147483648.0 до 2147483647.0.

double: диапазон от -9223372036854775808.0 до  9223372036854775807.0.

long double: диапазон от -9223372036854775808.0 до  9223372036854775807.0.

bool: диапазон от 0 до 1.

void: тип без значения, диапазон от 0 до 0."""

P_8 = """Правила названия переменных
1)	Первый символ не цифра;
2)	Содержит только латиницу;
3)	Не совпадает с ключевыми словами.
"""

P_9 = """Структура оператора присваивания

*=*"""

P_10 = """Пре-инкремент ++x
Пре-декремент −−x
Пост-инкремент x++
Пост-декремент x−−

x = x + t
x += t

x = x - t
x -= t

x = x \* t
x \*= t

x = x / t
x /= t

x = x % t
x %= t"""

P_11 = """Сначала умножение, деление слева-направо, потом плюсы и минусы слева-направо."""

video = """_Вы сегодня особенно красивы_"""

ostap = """Вопрос моей лекции — благоприятная первая мысль. Что такое, участники, дебют и что такое, коллеги, мысль? Дебют, собратья, — это «Quasi una fantasia». А что такое, сотоварищи, знаменует мысль? Мысль, сотрудники, — это людская дума, облечённая в разумную клетчатую модель."""

suck = """[Интро]
Попей!

[Рефрен]
У, у, у, у, у
Да, я зажиточный уёбок, а (money)
У меня деньжонок так много, а (cash)
Моё ебало — мульда (у, у, у, у, у)
Критикуй, бля, ты эдакий дробный, а?
Ты же базарил так звучно (пиздел)
Да так и бытовать выполняй карточку (в-у)
(Пока я здоровый, отростка)
Да, я пиздец охуевший (да)
Отростка твоя без сутаны, эй (у, у, у, у)
Я поднесу ей острота (пол)
(Три сюда!)
Прыг-прыг ей прямо край конечностей
Подъедаю промежность (ам)
Это, сучка, склонность

[Куплет 1]
Осуждай ты мне сча возразишь? (а-а?)
Сучка, ты сынишка частный (мучить!)
Rollie на мне — швейцарские (свет)
Гряда на мне — это важно (chain)
Ходи поешь, ты, смесь (ам)
Я пока ногти окрашу (ва-а)
Сучки твоей буду красивый (я-я)
Она признаёт меня крашем, эй
Я — надпись, как Цой (э-эй!)
Но этакий мальчишка (как Цой!)
Смирился лепёшкой (ав-у-у!)
Считай, типа безголовый (эй)
Считай эго, мне похуй (похуй)
Чё, dababy? Да похуй (Да похуй)
Хуй гигантский, как конец (конец)
На мне изменяется проблема


[Спорт]
Баунс, баунс, баунс, баунс
Баунс, баунс, баунс, баунс
Баунс, баунс, баунс, баунс
А, я всё

[Куплет 2]
Остроты в бахтарму, отростка
Я тебе чё, Иуда? (what?)
С королевством делал? (дожидается)
Не, но теперь буду (е)
Чё ещё? Типа дворецкий? (what?)
Свершил деньжата на дураках? (дебилах)
Да, это так, но на дебилах, что хейтят меня в комментариях! (ва-х)

[Рефрен]
У, у, у, у, у
Да, я богатенький уёбок, а (money)
У меня деньжат так много, а (cash)
Моё ебало — мульда (у, у, у, у, у; струя!)
Брани, бля, ты таковой дробный, а?
Ты же базарил так звучно (пиздел)
Да так и бытовать создавай фотографию
(Дрожат рукояти, ха-ха)
Да, я пиздец охуевший (да)
Сучка твоя без чадры, эй
Я пожалую ей острота (пол; у, у, у, у)
(Ступай сюда!)
Прыг-прыг ей прямо край лап
Приканчиваю промежность (ам-ам)
Это, сучка, склонность


[Аутро]
*Репутация, что ты сд—*"""

cadillac = """[Интро: MORGENSHTERN]
*Осанна, что ты нашёл?*
Ха

[Рефрен: MORGENSHTERN]
Эй, линия на мне, шероховатость лавэ
Единица тысяч на bag LV
Сотни отросток вожделеют ко мне
Сотни отросток алкают клинкеров
Эй, как дела? Как дела?
Это последний Cadillac
Выполнять средства, тереть деньжата
Выделывать средства, блять, вот так (окей, few)

[Куплет 1: MORGENSHTERN]
Ayy, bitch, we got some площади (пр-р, пау)
Пау-пау, встретился по туше (ха)
На мне ща двойка пневмоподушки (оу да)
Bitch, я свисаю, как жених Пушкин (у)
Гряды угрожают на понтифику (е)
Пашем кэш лопаткой (е)
Зажиточный будто каппер (е)
Как там твоя получка?


[Спорт: MORGENSHTERN]
Эй, взглянь
Банан мультфильма на мне — репетиры
Три на гривне, семеро под проблемой
Мне чуть больше двадцати
Осмотрись, осмотрись
Банан виртуала на мне — дни
Удовлетворительные на реке, семеро под проблемой
Мне чуть больше двадцати

[Рефрен: MORGENSHTERN]
Эй, линия на мне, шероховатость лавэ
Единица тысяч на bag LV
Сотни сучок вожделеют ко мне
Сотни сучок стремятся гранатов
Эй, как дела? Как дела?
Это следующий Cadillac
Действовать деньжонки, ставить деньжата
Свершать средства, блять, вот так

[Куплет 2: Элджей]
I am busy, мне похуй на дефицит, я в нём возник (уа-уа-уа)
Кто о чём грезил, то мы и получили на удар (бля-я)
Эдлиб здоровей, чем полный мелодичный турбизнес (блё-блё)
Таковой фит стрельнёт внезапнее, чем ко-ро-на-ви-рус
Sayonara "Sick" Boy
Это мой угол, это мой жон
Это мой дворик, ебейший chill zone
Зеленый японец с ясным навесом
Под сильным биржевым осадком
(Кх-кх-кх) Фенимор Купер
Пируэт лукбука
Твоя подруга дрочит
На мой автомобиль у единомышленника"""

baby = """[Рефрен: Лук]
Хэй, маленькая
У тебя слишком прекрасная причёска
Хэй, девочка
Мы замираем под ливнем слишком скоро

[Куплет 1: Лук]
Я тяжесть консервы
Где нет плохого и лилейного электрики
В городке развал
Мне начихать на это
Если с провидения низвергает гранат
Моя шавка до нового рядом
Если дома дожидается пищи
Моя кошка, моет нычки и пеленги
Ведь мне нет тридцатки
Я в династии всегда существовал сущим молоднякам
Ведь мне нет тридцатки
Я прикатываю на радиоконцерт, исполняю песнь своей цели

[Рефрен: Пирог]
Кроха
У тебя слишком замечательная скобка
Эй, девочка
Мы замираем под осадком слишком присно


[Спорт: Лук]
Эй, только не придумывай
Бери за крышу любимую и передвигайся
Эй, только не преувеличивай
Не на воображай копеечные триметры

[Куплет 2: MORGENSHTERN]
(Few-few)
Это источник (источник, few), money long (long, е)
На мне hoe (hoe), она обеспечила мне топот (топот)
Отростка это союз (источник), е, money long (few, ба)
На мне hoe (е), как-же заебло
Сучка это источник (союз, е), на мне хоу (хоу)
Как ты заебла (брр), я алкаю связь
Деточка, я желаю привязанность
Ты не то, ты не то, всё не то
Луковка, я стремлюсь домой
Детва, я алкаю домой
Дрожу в дорогой Мерседес (врум-врум)
И я трапезу по Москве (е)
Чё за пункт мне встречается? (пр-р-пр-р-пр-р-пр-р)
Я его уже оставил (позабыл)
Отец вожделеет party (пр-пау)
Родитель, ну куда ты? Ударит, замирай
Сотни отросток в моей койки (фу-фу-фу-фу)
Но ни с одной не буду засыпать я (дожидается)
Детва, ты не моя boo, я выброшу тебя к утречку
А завтра новую сочту (е-э)
Детва, я тебе не рассказываю, да, я так значительным балакаю
Но луковка, я тебя боготворю (боготворю)


[Рефрен: Лук]
Хэй, крошка
У тебя слишком кайфовая скобка
Хэй, лилипутка
Мы замираем под ливнем слишком присно
Хэй, маленькая
У тебя слишком правильная скобка
Хэй, маленькая
Мы замираем под осадком слишком скоро"""

ice = """[Монастырь]
А-а, я не дам хлебец
Я металлург, подвизаюсь три периода, ы-а
Без платы, у-а, я не передам, я жаден
Эй, затроньте свой лом

[Код Саунд-продюсера: Slava Marlow]
*Популярность, что ты изготовил?*

[Рефрен]
Эти линии на мне, настоящую сучку так привлекает
Закаменел, будто бездушный гранат
Нахуй встречу, т.к. мы не выступаем
Разберу всё, будто бы я вахлак
Эти линии на—

[Куплет 1]
Эй (few), м-м (ice) линия на мне — это ice (ледок, few)
Сломал им голову, вынес им башку будто праздник (да прямо с плечик, few)
(Wha) м-м (ай, few), на-на мне biggest price (check), м, призыв
Он опять воспринимает про то, экий он пиздатый? (ага!)
Попизди мне типа безмозглый, да только мой флоу — конфетка (sweet)
Ем взятку бабушек — ты с бабусей ел пачку (ха-ха)
Неподвижный neck, да, бездушный wrist, я будто бы в твердом дне (i-i-ice, эй, few)
Я дурной, но мне очистят деньжонки


[Спорт]
Эти гряды на мне, таковую отростку так зовёт
Закамен— (ah!)

[Куплет 2: MORGENSHTERN, Азиз Аминович]
Выебал настоящую, а, хм (ah-ah!)
Выебал данную thottie (a-ah!)
В Cadillac'е да Cadillac'е на арбате (да, прямо пол)
По-попытайся по-до-дойти ты к моей халупе, брат (ну вручай!)
Азиз Аминович, (хозяин?) обманывайте автоматик (ту-ту-ту-ту)
Захожу в бу, сучка будто Малибу (few-few, бу!)
Я ебу её так глупо, как ебу линию (ебу, ah!)
Я ебу её как будто рэперское true (facts)
Ах, трахнул — мотнул, будто рэп-игру, м
И я ей не побрякаю (м-м-м-м)

[Рефрен]
Эти совокупности на мне сию сучку так притягивает
Закаменел, будто жестокий гранат
Нахуй игрушку, т.к. мы не исполняем
Лишу всё, будто бы я вахлак
Эти гряды на мне, таковую отростку так притягивает
Закаменел, будто загрубелый флюорит
Нахуй игрушку, т.к. мы не исполняем
Лишу всё, будто бы я крымчанин
Эти гряды на мне"""
